posts/2020-03-11-xeros-irc-ref.org
#+title: xero's irc ref
#+pubdate: <2020-04-04 Sat>

This is a scraping of xero's irc ref from https://gist.github.com/xero/2d6e4b061b4ecbeb9f99

** The Basics
:PROPERTIES:
:CUSTOM_ID: h-af9b727a-fe44-40f2-8ba6-e18272277397
:END:

| command                    | meaning                                                                       |
| =/join #channel=           | Joins the specified channel.                                                  |
| =/part #channel=           | Leaves the specified channel.                                                 |
| =/quit <message>=          | Disconnects from current server with optional leaving message.                |
| =/server hostname=         | Connects to the specified server.                                             |
| =/list=                    | Lists all channels on the current network.                                    |
| =/links=                   | Lists all servers on the current network. May be disabled "for                |
| =/nick nickname=           | Changes your nick.                                                            |
| =/names #channel=          | Shows the nicks of all users on #channel.                                     |
| =/msg nickname message=    | Sends a private message to a user.                                            |
| =/query nickname message=  | Sends a private message to a user and opens a private chat window.            |
| =/me action=               | Prints "yourname action"                                                      |
| =/notice nickname message= | Sends a notice to the specified user. Like a /msg, but usually makes a sound. |
| =/whois nickname=          | Shows information about the specified user. This action is not                |
| =/whowas nickname=         | Shows information about a user who has quit.                                  |
| =/dns nickname=            | Attempts to resolve the IP address of the specified user. Doesn't             |
| =/ping nickname=           | Pings the specified user. This action is visible to the specified user.       |

** Nick Management (NickServ)
:PROPERTIES:
:CUSTOM_ID: h-4404e409-385b-48dd-9eb1-b42e9f161876
:END:

All nickserv commands begin with =/ns= or =/msg NickServ=. Depending on your client, =/ns= may not work.

| =/ns register password <email>=    | Registers your current nick with NickServ with the chosen password and binds it to an e-mail address (optional).        |
| =/ns identify password=            | Identifies your nick to NickServ using the password you set. If you have a nick that's been registered, and you don't i |
| =/ns recover nickname password=    | Kills (forcibly disconnects) someone who has your registered nick.                                                      |
| =/ns ghost nickname password=      | Terminates a "ghost" IRC session that's using your nickname.                                                            |
| =/ns set password yournewpassword= | Changes your password. *NOTE:* Under no circumstances should you change your nick to the letter O followed by 8 digit   |

** Channel modes
:PROPERTIES:
:CUSTOM_ID: h-6dc4ab3f-d0ed-4c66-b41a-719058cb93c2
:END:

Set a mode with: =/mode #channel +/-attribute <data>=.

| =+n=          | Disallows external messages.                                       |
| =+t=          | Only op/hops can set the topic.                                    |
| =+p=          | Sets the channel as invisible in /list.                            |
| =+s=          | Sets the channel as invisible in /list and /whois.                 |
| =+i=          | Sets the channel as closed unless the person was invited.          |
| =+k <pass>=   | Sets a password for the channel which users must enter to join.    |
| =+l <number>= | Sets a limit on the number of users who are allowed in the channel |
| =+m=          | Prevents users who are not opped/hopped/voiced from talking.       |
| =+R=          | Sets the channel so only registered nicks are allowed in.          |
| =+M=          | Sets the channel so only registered nicks are allowed to talk.     |
| =+S=          | Strips formatting from messages, rendering them as plaintext.      |
| =+c=          | Blocks messages containing color codes.                            |
| =+i=          | A user must be invited to join the channel.                        |
| =+N=          | No nick changes permitted in the channel.                          |

