xeros-irc-ref.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-03 Sun 17:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>xero's irc ref</title>
<meta name="generator" content="Org mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="./assets/css/notes.css">
<link rel="stylesheet" href="./assets/css/scaffold.css">
</head>
<body>
<div id="content">
<h1 class="title">xero's irc ref</h1>
<div class="org-center">
<p>
<a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/2020-03-11-xeros-irc-ref.org">2020-04-10</a> • 2020-04-04
</p>
</div>

<p>
This is a scraping of xero's irc ref from <a href="https://gist.github.com/xero/2d6e4b061b4ecbeb9f99">https://gist.github.com/xero/2d6e4b061b4ecbeb9f99</a>
</p>

<div id="outline-container-org0b963ba" class="outline-3">
<h3 id="h-af9b727a-fe44-40f2-8ba6-e18272277397">The Basics</h3>
<div class="outline-text-3" id="text-h-af9b727a-fe44-40f2-8ba6-e18272277397">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">command</td>
<td class="org-left">meaning</td>
</tr>

<tr>
<td class="org-left"><code>/join #channel</code></td>
<td class="org-left">Joins the specified channel.</td>
</tr>

<tr>
<td class="org-left"><code>/part #channel</code></td>
<td class="org-left">Leaves the specified channel.</td>
</tr>

<tr>
<td class="org-left"><code>/quit &lt;message&gt;</code></td>
<td class="org-left">Disconnects from current server with optional leaving message.</td>
</tr>

<tr>
<td class="org-left"><code>/server hostname</code></td>
<td class="org-left">Connects to the specified server.</td>
</tr>

<tr>
<td class="org-left"><code>/list</code></td>
<td class="org-left">Lists all channels on the current network.</td>
</tr>

<tr>
<td class="org-left"><code>/links</code></td>
<td class="org-left">Lists all servers on the current network. May be disabled "for</td>
</tr>

<tr>
<td class="org-left"><code>/nick nickname</code></td>
<td class="org-left">Changes your nick.</td>
</tr>

<tr>
<td class="org-left"><code>/names #channel</code></td>
<td class="org-left">Shows the nicks of all users on #channel.</td>
</tr>

<tr>
<td class="org-left"><code>/msg nickname message</code></td>
<td class="org-left">Sends a private message to a user.</td>
</tr>

<tr>
<td class="org-left"><code>/query nickname message</code></td>
<td class="org-left">Sends a private message to a user and opens a private chat window.</td>
</tr>

<tr>
<td class="org-left"><code>/me action</code></td>
<td class="org-left">Prints "yourname action"</td>
</tr>

<tr>
<td class="org-left"><code>/notice nickname message</code></td>
<td class="org-left">Sends a notice to the specified user. Like a /msg, but usually makes a sound.</td>
</tr>

<tr>
<td class="org-left"><code>/whois nickname</code></td>
<td class="org-left">Shows information about the specified user. This action is not</td>
</tr>

<tr>
<td class="org-left"><code>/whowas nickname</code></td>
<td class="org-left">Shows information about a user who has quit.</td>
</tr>

<tr>
<td class="org-left"><code>/dns nickname</code></td>
<td class="org-left">Attempts to resolve the IP address of the specified user. Doesn't</td>
</tr>

<tr>
<td class="org-left"><code>/ping nickname</code></td>
<td class="org-left">Pings the specified user. This action is visible to the specified user.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1736a5f" class="outline-3">
<h3 id="h-4404e409-385b-48dd-9eb1-b42e9f161876">Nick Management (NickServ)</h3>
<div class="outline-text-3" id="text-h-4404e409-385b-48dd-9eb1-b42e9f161876">
<p>
All nickserv commands begin with <code>/ns</code> or <code>/msg NickServ</code>. Depending on your client, <code>/ns</code> may not work.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>/ns register password &lt;email&gt;</code></td>
<td class="org-left">Registers your current nick with NickServ with the chosen password and binds it to an e-mail address (optional).</td>
</tr>

<tr>
<td class="org-left"><code>/ns identify password</code></td>
<td class="org-left">Identifies your nick to NickServ using the password you set. If you have a nick that's been registered, and you don't i</td>
</tr>

<tr>
<td class="org-left"><code>/ns recover nickname password</code></td>
<td class="org-left">Kills (forcibly disconnects) someone who has your registered nick.</td>
</tr>

<tr>
<td class="org-left"><code>/ns ghost nickname password</code></td>
<td class="org-left">Terminates a "ghost" IRC session that's using your nickname.</td>
</tr>

<tr>
<td class="org-left"><code>/ns set password yournewpassword</code></td>
<td class="org-left">Changes your password. <b>NOTE:</b> Under no circumstances should you change your nick to the letter O followed by 8 digit</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge052c90" class="outline-3">
<h3 id="h-6dc4ab3f-d0ed-4c66-b41a-719058cb93c2">Channel modes</h3>
<div class="outline-text-3" id="text-h-6dc4ab3f-d0ed-4c66-b41a-719058cb93c2">
<p>
Set a mode with: <code>/mode #channel +/-attribute &lt;data&gt;</code>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>+n</code></td>
<td class="org-left">Disallows external messages.</td>
</tr>

<tr>
<td class="org-left"><code>+t</code></td>
<td class="org-left">Only op/hops can set the topic.</td>
</tr>

<tr>
<td class="org-left"><code>+p</code></td>
<td class="org-left">Sets the channel as invisible in /list.</td>
</tr>

<tr>
<td class="org-left"><code>+s</code></td>
<td class="org-left">Sets the channel as invisible in /list and /whois.</td>
</tr>

<tr>
<td class="org-left"><code>+i</code></td>
<td class="org-left">Sets the channel as closed unless the person was invited.</td>
</tr>

<tr>
<td class="org-left"><code>+k &lt;pass&gt;</code></td>
<td class="org-left">Sets a password for the channel which users must enter to join.</td>
</tr>

<tr>
<td class="org-left"><code>+l &lt;number&gt;</code></td>
<td class="org-left">Sets a limit on the number of users who are allowed in the channel</td>
</tr>

<tr>
<td class="org-left"><code>+m</code></td>
<td class="org-left">Prevents users who are not opped/hopped/voiced from talking.</td>
</tr>

<tr>
<td class="org-left"><code>+R</code></td>
<td class="org-left">Sets the channel so only registered nicks are allowed in.</td>
</tr>

<tr>
<td class="org-left"><code>+M</code></td>
<td class="org-left">Sets the channel so only registered nicks are allowed to talk.</td>
</tr>

<tr>
<td class="org-left"><code>+S</code></td>
<td class="org-left">Strips formatting from messages, rendering them as plaintext.</td>
</tr>

<tr>
<td class="org-left"><code>+c</code></td>
<td class="org-left">Blocks messages containing color codes.</td>
</tr>

<tr>
<td class="org-left"><code>+i</code></td>
<td class="org-left">A user must be invited to join the channel.</td>
</tr>

<tr>
<td class="org-left"><code>+N</code></td>
<td class="org-left">No nick changes permitted in the channel.</td>
</tr>
</tbody>
</table>
</div>
</div>
