posts/2020-03-11-xeros-irc-ref.org
** ChanServ commands
:PROPERTIES:
:CUSTOM_ID: h-a226cb18-b018-4504-8261-0b65f28a02e5
:END:

All ChanServ commands begin with =/cs= or =/chanserv= or =/msg ChanServ=. Depending on your client, =/cs= or =/chanserv= may not work.


# pain
# #+MACRO:  code @@html:<code>@@$1@@html:</code>@@
# using ! so org tables cal still align and \vert{} inline looks gross to me here
#+MACRO: code (eval (format "@@html:<code>@@%s@@html:</code>@@" (s-replace "!" "\\vert{}" $1)))

| {{{code(/cs set #channel secureops <on!off>)}}} | Keeps everyone except aops, sops, and the founder from becoming ops.                      |
| =/cs identify #channel <password>=              | Identifies you as the channel's founder and gives you founder-level privileges.           |
| =/cs set #channel mlock modes=                  | Locks the channel's modes. Just + unlocks all.                                            |
| {{{code(/cs set #channel keeptopic <on!off>)}}} | Maintains the topic even if everyone leaves.                                              |
| {{{code(/cs set #channel enforce <on!off>)}}}   | Restores op/halfop/voice if a person with op/halfop/voice gets de-opped/halfopped/voiced. |
| {{{code(/cs set #channel leaveops <on!off>)}}}  | Whether or not to allow the first person who join the channel to get ops.                 |
| =/cs register #channel password description=    | Registers the current channel to you with ChanServ and sets its password and description. |
| =/cs drop #channel <dropcode>=                  | Un-registers the current channel to you with ChanServ.                                    |
| =/cs set #channel founder <nickname>=           | Sets the current channel's founder.                                                       |
| =/cs set #channel password <newpass>=           | Changes the current channel's password to newpass.                                        |
| =/cs set #channel desc <description>=           | Changes the current channel's description.                                                |
| =/cs set #channel url <address>=                | Associates a URL with the channel.                                                        |
| =/cs set #channel <email@address>=              | Associates an email address with the channel.                                             |

* Other stuff
:PROPERTIES:
:CUSTOM_ID: h-b90868c6-7968-4fa1-b6fb-de667b7599c1
:END:

** Kicking people
:PROPERTIES:
:CUSTOM_ID: h-d321c0d4-db80-4f25-8941-933172fac07e
:END:

| =/kick #channel nickname <reason>=    | temporarily remove user from channel              |
| =/mode nickname +/-attributes <data>= | Setting people's modes (for current channel only) |

** User modes
:PROPERTIES:
:CUSTOM_ID: h-c03ad93e-65cc-4dd6-9aa7-af5c82dcf350
:END:

| =+q= | User is owner of the current channel (prefix ~ on UnrealIRCd, usually @ elsewhere)           |
| =+a= | User is an admin (SOP) on the current channel (prefix & on UnrealIRCd, usually @ elsewhere). |
| =+o= | User is an operator (AOP) on the current channel (prefix @).                                 |
| =+h= | User is a half-op on the current channel (prefix %).                                         |
| =+v= | User has voice on the current channel (prefix +).                                            |

** Banning people
:PROPERTIES:
:CUSTOM_ID: h-07580360-b48c-4a4a-818a-61f1f750ecfc
:END:

- =/mode *channel +b hosts=
  - Hosts take the following form: =nickname!userid@hostname=

- Use =/whois=, =/whowas= or =/who= to find the information necessary for a ban.
- =*= is a wildcard and can replace =nickname=, =userid=, parts of nickname or =userid=, =hostname= or a segment of a =hostname=.

*** Examples:
:PROPERTIES:
:CUSTOM_ID: h-1cca042b-1f35-4d85-acf0-e379c7224f4d
:END:

| =joe!*@*=                        | Will prevent anyone with the nick joe from joining.                        |
| =*myg0t*!*=                      | Will prevent anyone whose nick contains myg0t from joining.                |
| =mark!*elc@*=                    | Will prevent anyone with the nick mark and the userid elc from joining.    |
| =*!*@c-123-24-76-213.ga.isp.net= | Will prevent anyone with the host c-123-24-76-213.ga.isp.net from joining. |
| =*!*@*=                          | Bans everyone. Don't do that.                                              |

** Access lists
:PROPERTIES:
:CUSTOM_ID: h-76341ce0-127b-4af7-bb0c-7f0e46086748
:END:

| =/cs access #channel add <nickname> <level>= | Adds nickname to the channel's access list at the specified level. |
| =/cs access #channel del <nickname>=         | Removes nickname from the channel's access list.                   |
| =/cs access #channel list=                   | Displays the channel's access list.                                |
| =/cs access #channel count=                  | Displays how many entries are in the channel's access list.        |

*** Access levels
:PROPERTIES:
:CUSTOM_ID: h-249213a8-a9fa-43e9-9a46-f9d15df4f420
:END:

 These may vary from network to network. For example, some networks do
 not go by tens and use 3, 4, 5, 10, etc.

 | =Founder= | Full access to ChanServ functions, automatic opping upon entering channel. |
 | =100+=    | Makes the person an SOP, automatic opping upon entering channel.           |
 | =50=      | Makes the parson an AOP, automatic opping upon entering channel.           |
 | =40=      | Automatic half-opping.                                                     |
 | =30=      | Automatic voicing.                                                         |
 | =0=       | No special privileges.                                                     |
 | =-1=      | May not be opped.                                                          |
 | =-100=    | May not join the channel.                                                  |

 Any nick not on the access list has an access level of =0=.

* AOPs and SOPs
:PROPERTIES:
:CUSTOM_ID: h-c32b1089-530f-473f-9331-1c78baab2b41
:END:

