xeros-irc-ref.html

<div id="outline-container-org64f4ca8" class="outline-3">
<h3 id="h-a226cb18-b018-4504-8261-0b65f28a02e5">ChanServ commands</h3>
<div class="outline-text-3" id="text-h-a226cb18-b018-4504-8261-0b65f28a02e5">
<p>
All ChanServ commands begin with <code>/cs</code> or <code>/chanserv</code> or <code>/msg ChanServ</code>. Depending on your client, <code>/cs</code> or <code>/chanserv</code> may not work.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>/cs set #channel secureops &lt;on&vert;off&gt;</code></td>
<td class="org-left">Keeps everyone except aops, sops, and the founder from becoming ops.</td>
</tr>

<tr>
<td class="org-left"><code>/cs identify #channel &lt;password&gt;</code></td>
<td class="org-left">Identifies you as the channel's founder and gives you founder-level privileges.</td>
</tr>

<tr>
<td class="org-left"><code>/cs set #channel mlock modes</code></td>
<td class="org-left">Locks the channel's modes. Just + unlocks all.</td>
</tr>

<tr>
<td class="org-left"><code>/cs set #channel keeptopic &lt;on&vert;off&gt;</code></td>
<td class="org-left">Maintains the topic even if everyone leaves.</td>
</tr>

<tr>
<td class="org-left"><code>/cs set #channel enforce &lt;on&vert;off&gt;</code></td>
<td class="org-left">Restores op/halfop/voice if a person with op/halfop/voice gets de-opped/halfopped/voiced.</td>
</tr>

<tr>
<td class="org-left"><code>/cs set #channel leaveops &lt;on&vert;off&gt;</code></td>
<td class="org-left">Whether or not to allow the first person who join the channel to get ops.</td>
</tr>

<tr>
<td class="org-left"><code>/cs register #channel password description</code></td>
<td class="org-left">Registers the current channel to you with ChanServ and sets its password and description.</td>
</tr>

<tr>
<td class="org-left"><code>/cs drop #channel &lt;dropcode&gt;</code></td>
<td class="org-left">Un-registers the current channel to you with ChanServ.</td>
</tr>

<tr>
<td class="org-left"><code>/cs set #channel founder &lt;nickname&gt;</code></td>
<td class="org-left">Sets the current channel's founder.</td>
</tr>

<tr>
<td class="org-left"><code>/cs set #channel password &lt;newpass&gt;</code></td>
<td class="org-left">Changes the current channel's password to newpass.</td>
</tr>

<tr>
<td class="org-left"><code>/cs set #channel desc &lt;description&gt;</code></td>
<td class="org-left">Changes the current channel's description.</td>
</tr>

<tr>
<td class="org-left"><code>/cs set #channel url &lt;address&gt;</code></td>
<td class="org-left">Associates a URL with the channel.</td>
</tr>

<tr>
<td class="org-left"><code>/cs set #channel &lt;email@address&gt;</code></td>
<td class="org-left">Associates an email address with the channel.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2e27253" class="outline-2">
<h2 id="h-b90868c6-7968-4fa1-b6fb-de667b7599c1">Other stuff</h2>
<div class="outline-text-2" id="text-h-b90868c6-7968-4fa1-b6fb-de667b7599c1">
</div>

<div id="outline-container-org726b854" class="outline-3">
<h3 id="h-d321c0d4-db80-4f25-8941-933172fac07e">Kicking people</h3>
<div class="outline-text-3" id="text-h-d321c0d4-db80-4f25-8941-933172fac07e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>/kick #channel nickname &lt;reason&gt;</code></td>
<td class="org-left">temporarily remove user from channel</td>
</tr>

<tr>
<td class="org-left"><code>/mode nickname +/-attributes &lt;data&gt;</code></td>
<td class="org-left">Setting people's modes (for current channel only)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc315159" class="outline-3">
<h3 id="h-c03ad93e-65cc-4dd6-9aa7-af5c82dcf350">User modes</h3>
<div class="outline-text-3" id="text-h-c03ad93e-65cc-4dd6-9aa7-af5c82dcf350">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>+q</code></td>
<td class="org-left">User is owner of the current channel (prefix ~ on UnrealIRCd, usually @ elsewhere)</td>
</tr>

<tr>
<td class="org-left"><code>+a</code></td>
<td class="org-left">User is an admin (SOP) on the current channel (prefix &amp; on UnrealIRCd, usually @ elsewhere).</td>
</tr>

<tr>
<td class="org-left"><code>+o</code></td>
<td class="org-left">User is an operator (AOP) on the current channel (prefix @).</td>
</tr>

<tr>
<td class="org-left"><code>+h</code></td>
<td class="org-left">User is a half-op on the current channel (prefix %).</td>
</tr>

<tr>
<td class="org-left"><code>+v</code></td>
<td class="org-left">User has voice on the current channel (prefix +).</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org991a137" class="outline-3">
<h3 id="h-07580360-b48c-4a4a-818a-61f1f750ecfc">Banning people</h3>
<div class="outline-text-3" id="text-h-07580360-b48c-4a4a-818a-61f1f750ecfc">
<ul class="org-ul">
<li><code>/mode *channel +b hosts</code>
<ul class="org-ul">
<li>Hosts take the following form: <code>nickname!userid@hostname</code></li>
</ul></li>

<li>Use <code>/whois</code>, <code>/whowas</code> or <code>/who</code> to find the information necessary for a ban.</li>
<li><code>*</code> is a wildcard and can replace <code>nickname</code>, <code>userid</code>, parts of nickname or <code>userid</code>, <code>hostname</code> or a segment of a <code>hostname</code>.</li>
</ul>
</div>

<div id="outline-container-org8b8fcfc" class="outline-4">
<h4 id="h-1cca042b-1f35-4d85-acf0-e379c7224f4d">Examples:</h4>
<div class="outline-text-4" id="text-h-1cca042b-1f35-4d85-acf0-e379c7224f4d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>joe!*@*</code></td>
<td class="org-left">Will prevent anyone with the nick joe from joining.</td>
</tr>

<tr>
<td class="org-left"><code>*myg0t*!*</code></td>
<td class="org-left">Will prevent anyone whose nick contains myg0t from joining.</td>
</tr>

<tr>
<td class="org-left"><code>mark!*elc@*</code></td>
<td class="org-left">Will prevent anyone with the nick mark and the userid elc from joining.</td>
</tr>

<tr>
<td class="org-left"><code>*!*@c-123-24-76-213.ga.isp.net</code></td>
<td class="org-left">Will prevent anyone with the host c-123-24-76-213.ga.isp.net from joining.</td>
</tr>

<tr>
<td class="org-left"><code>*!*@*</code></td>
<td class="org-left">Bans everyone. Don't do that.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org303ecb4" class="outline-3">
<h3 id="h-76341ce0-127b-4af7-bb0c-7f0e46086748">Access lists</h3>
<div class="outline-text-3" id="text-h-76341ce0-127b-4af7-bb0c-7f0e46086748">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>/cs access #channel add &lt;nickname&gt; &lt;level&gt;</code></td>
<td class="org-left">Adds nickname to the channel's access list at the specified level.</td>
</tr>

<tr>
<td class="org-left"><code>/cs access #channel del &lt;nickname&gt;</code></td>
<td class="org-left">Removes nickname from the channel's access list.</td>
</tr>

<tr>
<td class="org-left"><code>/cs access #channel list</code></td>
<td class="org-left">Displays the channel's access list.</td>
</tr>

<tr>
<td class="org-left"><code>/cs access #channel count</code></td>
<td class="org-left">Displays how many entries are in the channel's access list.</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org240d993" class="outline-4">
<h4 id="h-249213a8-a9fa-43e9-9a46-f9d15df4f420">Access levels</h4>
<div class="outline-text-4" id="text-h-249213a8-a9fa-43e9-9a46-f9d15df4f420">
<p>
These may vary from network to network. For example, some networks do
not go by tens and use 3, 4, 5, 10, etc.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>Founder</code></td>
<td class="org-left">Full access to ChanServ functions, automatic opping upon entering channel.</td>
</tr>

<tr>
<td class="org-left"><code>100+</code></td>
<td class="org-left">Makes the person an SOP, automatic opping upon entering channel.</td>
</tr>

<tr>
<td class="org-left"><code>50</code></td>
<td class="org-left">Makes the parson an AOP, automatic opping upon entering channel.</td>
</tr>

<tr>
<td class="org-left"><code>40</code></td>
<td class="org-left">Automatic half-opping.</td>
</tr>

<tr>
<td class="org-left"><code>30</code></td>
<td class="org-left">Automatic voicing.</td>
</tr>

<tr>
<td class="org-left"><code>0</code></td>
<td class="org-left">No special privileges.</td>
</tr>

<tr>
<td class="org-left"><code>-1</code></td>
<td class="org-left">May not be opped.</td>
</tr>

<tr>
<td class="org-left"><code>-100</code></td>
<td class="org-left">May not join the channel.</td>
</tr>
</tbody>
</table>

<p>
Any nick not on the access list has an access level of <code>0</code>.
</p>
</div>
</div>
</div>
</div>
