posts/2020-03-11-xeros-irc-ref.org
** AOPs
:PROPERTIES:
:CUSTOM_ID: h-253a1f1e-e527-461b-b323-b92cabde0574
:END:

- Are automatically ops and can give themselves ops.
- Can give/take op/halfop/voice to/from other channel members.
- Can unban themselves.
- Receive memos sent to the whole channel.
- Can invite themselves to the channel.

** SOPs
:PROPERTIES:
:CUSTOM_ID: h-a395932a-b851-4a52-958c-05987399ff40
:END:

- Can do everything AOPs can.
- Can give and take AOP privileges.
- Receive memos sent to the channel's SOPs.
- Can add (but not remove) AKICKs.

** Viewing and setting privileges
:PROPERTIES:
:CUSTOM_ID: h-da4abeac-93a5-427a-87cc-270d9cd61125
:END:

| {{{code(/cs <aop!sop> #channel list=)}}}                                  | Viewing AOP and SOP lists |
| {{{code(/cs <AOP!SOP> #channel <ADD!DEL!LIST!CLEAR> <nick!entry-list>)}}} | adding a AOP or SOP       |

** AKICKs
:PROPERTIES:
:CUSTOM_ID: h-e0d5cdf5-5b64-4da5-8973-c00702bc3107
:END:

People on the AKICK list are automatically kicked and banned when they
enter the channel. Bans made as a result of AKICK must be removed
manually.

| =/cs akick #channel add host <reason>=     | Adds host to #channel's AKICK list (for reason). |
| =/cs akick #channel del host=              | Removes host from the AKICK list.                |
| {{{code(/cs akick #channel <list!view>)}}} | Displays the AKICK list.                         |

** Color codes
:PROPERTIES:
:CUSTOM_ID: h-783bf87b-f96c-4b8d-a756-651cb73c3a64
:END:

it's possible to color your text in irc. in most clients you can use
control c then foreground,background (background is optional). examples:
red text =^c4=. black text on a blue background =^c1,2=. here's a full
list of the color codes:

| Number | Name                          |
|--------+-------------------------------|
|     00 | white                         |
|     01 | black                         |
|     02 | blue (navy)                   |
|     03 | green                         |
|     04 | red                           |
|     05 | brown (maroon)                |
|     06 | purple                        |
|     07 | orange (olive)                |
|     08 | yellow                        |
|     09 | light green (lime)            |
|     10 | teal (a green/blue cyan)      |
|     11 | light cyan (cyan / aqua)      |
|     12 | light blue (royal)            |
|     13 | pink (light purple / fuchsia) |
|     14 | grey                          |
|     15 | light grey (silver)           |

** Related
:PROPERTIES:
:CUSTOM_ID: h-f34114f3-04ec-4275-a9e5-03dd636cff16
:END:

(cw: 🅱enis) https://youtu.be/R8FOGlnYkgg
