xeros-irc-ref.html

<div id="outline-container-org6915d9d" class="outline-2">
<h2 id="h-c32b1089-530f-473f-9331-1c78baab2b41">AOPs and SOPs</h2>
<div class="outline-text-2" id="text-h-c32b1089-530f-473f-9331-1c78baab2b41">
</div>

<div id="outline-container-orgbaf3bb0" class="outline-3">
<h3 id="h-253a1f1e-e527-461b-b323-b92cabde0574">AOPs</h3>
<div class="outline-text-3" id="text-h-253a1f1e-e527-461b-b323-b92cabde0574">
<ul class="org-ul">
<li>Are automatically ops and can give themselves ops.</li>
<li>Can give/take op/halfop/voice to/from other channel members.</li>
<li>Can unban themselves.</li>
<li>Receive memos sent to the whole channel.</li>
<li>Can invite themselves to the channel.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf5ad4c3" class="outline-3">
<h3 id="h-a395932a-b851-4a52-958c-05987399ff40">SOPs</h3>
<div class="outline-text-3" id="text-h-a395932a-b851-4a52-958c-05987399ff40">
<ul class="org-ul">
<li>Can do everything AOPs can.</li>
<li>Can give and take AOP privileges.</li>
<li>Receive memos sent to the channel's SOPs.</li>
<li>Can add (but not remove) AKICKs.</li>
</ul>
</div>
</div>

<div id="outline-container-org0856a97" class="outline-3">
<h3 id="h-da4abeac-93a5-427a-87cc-270d9cd61125">Viewing and setting privileges</h3>
<div class="outline-text-3" id="text-h-da4abeac-93a5-427a-87cc-270d9cd61125">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>/cs &lt;aop&vert;sop&gt; #channel list=</code></td>
<td class="org-left">Viewing AOP and SOP lists</td>
</tr>

<tr>
<td class="org-left"><code>/cs &lt;AOP&vert;SOP&gt; #channel &lt;ADD&vert;DEL&vert;LIST&vert;CLEAR&gt; &lt;nick&vert;entry-list&gt;</code></td>
<td class="org-left">adding a AOP or SOP</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc555270" class="outline-3">
<h3 id="h-e0d5cdf5-5b64-4da5-8973-c00702bc3107">AKICKs</h3>
<div class="outline-text-3" id="text-h-e0d5cdf5-5b64-4da5-8973-c00702bc3107">
<p>
People on the AKICK list are automatically kicked and banned when they
enter the channel. Bans made as a result of AKICK must be removed
manually.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>/cs akick #channel add host &lt;reason&gt;</code></td>
<td class="org-left">Adds host to #channel's AKICK list (for reason).</td>
</tr>

<tr>
<td class="org-left"><code>/cs akick #channel del host</code></td>
<td class="org-left">Removes host from the AKICK list.</td>
</tr>

<tr>
<td class="org-left"><code>/cs akick #channel &lt;list&vert;view&gt;</code></td>
<td class="org-left">Displays the AKICK list.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge924d3d" class="outline-3">
<h3 id="h-783bf87b-f96c-4b8d-a756-651cb73c3a64">Color codes</h3>
<div class="outline-text-3" id="text-h-783bf87b-f96c-4b8d-a756-651cb73c3a64">
<p>
it's possible to color your text in irc. in most clients you can use
control c then foreground,background (background is optional). examples:
red text <code>^c4</code>. black text on a blue background <code>^c1,2</code>. here's a full
list of the color codes:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Number</th>
<th scope="col" class="org-left">Name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">00</td>
<td class="org-left">white</td>
</tr>

<tr>
<td class="org-right">01</td>
<td class="org-left">black</td>
</tr>

<tr>
<td class="org-right">02</td>
<td class="org-left">blue (navy)</td>
</tr>

<tr>
<td class="org-right">03</td>
<td class="org-left">green</td>
</tr>

<tr>
<td class="org-right">04</td>
<td class="org-left">red</td>
</tr>

<tr>
<td class="org-right">05</td>
<td class="org-left">brown (maroon)</td>
</tr>

<tr>
<td class="org-right">06</td>
<td class="org-left">purple</td>
</tr>

<tr>
<td class="org-right">07</td>
<td class="org-left">orange (olive)</td>
</tr>

<tr>
<td class="org-right">08</td>
<td class="org-left">yellow</td>
</tr>

<tr>
<td class="org-right">09</td>
<td class="org-left">light green (lime)</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">teal (a green/blue cyan)</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">light cyan (cyan / aqua)</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">light blue (royal)</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">pink (light purple / fuchsia)</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">grey</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">light grey (silver)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb99d9ed" class="outline-3">
<h3 id="h-f34114f3-04ec-4275-a9e5-03dd636cff16">Related</h3>
<div class="outline-text-3" id="text-h-f34114f3-04ec-4275-a9e5-03dd636cff16">
<p>
(cw: 🅱enis) <a href="https://youtu.be/R8FOGlnYkgg">https://youtu.be/R8FOGlnYkgg</a>
</p>


<div class="org-center">
<p>
<a href="./index.html">Index</a> • <a href="https://neeasade.net">Root</a> • <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/2020-03-11-xeros-irc-ref.org">Source</a> • <a href="https://notes.neeasade.net/sitemap.html">Sitemap</a>
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
